Terraform plan in __.__
<details>
  <summary>Plan: 4 to add, 1 to change, 4 to destroy.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.jenkins.aws_lb_target_group_attachment.lb must be replaced
-/+ resource "aws_lb_target_group_attachment" "lb" {
      ~ id               = "**********************************************************************************************************************" -> (known after apply)
        target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:587807691409:targetgroup/ci-sandbox/7c36f3d06e4a7227"
      ~ target_id        = "*******************" -> (known after apply) # forces replacement
    }

  # module.jenkins.module.jenkins.aws_instance.default[0] is tainted, so must be replaced
-/+ resource "aws_instance" "default" {
      ~ ami                          = "ami-053adf54573f777cf" -> "ami-0747bdcabd34c712a"
      ~ arn                          = "arn:aws:ec2:us-east-1:587807691409:instance/i-0cc9ae9583ba49e9c" -> (known after apply)
        associate_public_ip_address  = false
      ~ availability_zone            = "us-east-1a" -> (known after apply)
      ~ cpu_core_count               = 2 -> (known after apply)
      ~ cpu_threads_per_core         = 1 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
        get_password_data            = false
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
        iam_instance_profile         = "jenkins_profile-ci-sandbox"
      ~ id                           = "*******************" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
        instance_type                = "t2.medium"
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
        key_name                     = "datagov-sandbox"
      - monitoring                   = false -> null
      + network_interface_id         = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "*********************" -> (known after apply)
      ~ private_dns                  = "ip-10-0-1-6.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.0.1.6" -> (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ security_groups              = [] -> (known after apply)
        source_dest_check            = true
        subnet_id                    = "************************"
        tags                         = {
            "Name"  = "jenkins1tf"
            "env"   = "sandbox"
            "group" = "jenkins"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ volume_tags                  = {
          - "env" = "sandbox"
        } -> (known after apply)
        vpc_security_group_ids       = [
            "sg-03f9b4bb6ced8088f",
            "sg-0599014293c0c3234",
        ]

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/xvdh" -> null
          - encrypted             = false -> null
          - iops                  = 180 -> null
          - volume_id             = "vol-0a61f2afa2124dcb6" -> null
          - volume_size           = 60 -> null
          - volume_type           = "gp2" -> null
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "********" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ volume_id             = "*********************" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # module.jenkins.module.jenkins.aws_route53_record.default[0] will be updated in-place
  ~ resource "aws_route53_record" "default" {
        fqdn    = "jenkins1tf.internal.sandbox.datagov.us"
        id      = "Z1006361VZ0GA3BRODCA_jenkins1tf_CNAME"
        name    = "jenkins1tf"
      ~ records = [
          - "ip-10-0-1-6.ec2.internal",
        ] -> (known after apply)
        ttl     = 300
        type    = "CNAME"
        zone_id = "********************"
    }

  # module.jenkins.module.jenkins.aws_volume_attachment.default[0] must be replaced
-/+ resource "aws_volume_attachment" "default" {
        device_name  = "/dev/xvdh"
      ~ id           = "*************" -> (known after apply)
      ~ instance_id  = "*******************" -> (known after apply) # forces replacement
        skip_destroy = true
        volume_id    = "*********************"
    }

  # module.jenkins.module.jenkins.null_resource.default[0] must be replaced
-/+ resource "null_resource" "default" {
      ~ id       = "*******************" -> (known after apply)
      ~ triggers = {
          - "attachment_ids" = "*************"
        } -> (known after apply) # forces replacement
    }

Plan: 4 to add, 1 to change, 4 to destroy.

Warning: Provider source not supported in Terraform v0.12

  on /github/home/.dflook-terraform-data-dir/modules/vpc.vpc/versions.tf line 5, in terraform:
   5:     aws = {
   6:       source  = "hashicorp/aws"
   7:       version = ">= 2.70"
   8:     }

A source was declared for provider aws. Terraform v0.12 does not support the
provider source attribute. It will be ignored.
```
</details>

Plan generated in [plan #28](https://github.com/GSA/datagov-infrastructure-live/actions/runs/779148512)